/* Наполнение базы данных */
use tickets_shop;

insert into actors (firstname, lastname) values
	('Светлана', 'Захарова'),
	('Евгения', 'Образцова'),
	('Юлия', 'Степанова'),
	('Артемий', 'Беляков'),
	('Семен', 'Чудин'),
	('Мария', 'Виноградова'),
	('Якопо', 'Тисси'),
	('Инна', 'Чурикова'),
	('Мария', 'Миронова'),
	('Дмитрий', 'Певцов'),
	('Игорь', 'Верник'),
	('Паулина', 'Андреева');
	
insert into genres (name) values
	('Балет'),
	('Опера'),
	('Комедия'),
	('Драма'),
	('Мюзикл'),
	('Мелодрама'),
	('Трагедия'),
	('Водевиль');
	
insert into scenes (name) values
	('Историческая'),
	('Малая'),
	('Основная');
	
insert into theaters (name, scene) values
	('Большой', 1),
	('Большой', 2),
	('Ленком', null),
	('МХТ им Чехова', 3),
	('Театр Сатиры', null),
	('Моссовета', null),
	('Театр Наций', null),
	('Современник', null),
	('Малый театр', null),
	('Рамт', null);

insert into categories (name) values
	('Партер'),
	('Амфитеатр'),
	('Балкон'),
	('Бельэтаж'),
	('Балкон 1-й ярус');

insert into media_types (name) values ('photo'), ('video');

insert into events (name, date_event, time_event, theatre, genre) values
	('Щелкунчик', '2019-12-31', '19:00', 1, 1),
	('Щелкунчик', '2019-12-31', '12:00', 1, 1),
	('Щелкунчик', '2020-01-03', '12:00', 1, 1),
	('Кармен', '2020-01-10', '19:00', 1, 2),
	('№ 13D', '2020-01-10', '19:00', 4, 3),
	('№ 13D', '2020-01-12', '19:00', 4, 3),
	('Мастер и Маргарита', '2020-01-15', '19:00', 4, 4),
	('Мастер и Маргарита', '2021-01-26', '19:00', 4, 4),
	('Вишневый сад', '2020-01-09', '19:00', 3, 4),
	('Юнона и Авось', '2021-01-26', '19:00', 3, 2);


INSERT IGNORE INTO tickets (event, category, number_row, number_position) VALUES
	(1, 1, 5, 14),
	(1, 1, 5, 15),
	(1, 1, 5, 16),
	(1, 1, 5, 17),
	(1, 1, 5, 18),
	(6, 2, 3, 4),
	(6, 2, 3, 5),
	(6, 2, 3, 6),
	(6, 2, 3, 7),
	(6, 2, 3, 8),
	(10, 4, 1, 10),
	(10, 4, 1, 11),
	(10, 4, 1, 12),
	(10, 4, 1, 13),
	(10, 4, 1, 14),
	(10, 4, 1, 15);

insert into events_actors (event_id, actor_id) values
	(1, 1),
	(2, 3),
	(3, 2),
	(3, 4),
	(4, 7),
	(4, 6),
	(5, 8),
	(6, 9),
	(7, 9),
	(1, 11);

insert into media (media_type_id, event_id, body, filename, `size`) values
	(1, 4, 'fsfsefsf', 'photo1', 10),
	(1, 7, 'adawdawda', 'photo_21-10_ccam', 112),
	(1, 3, 'kjhkjhkh', 'camp4582', 135),
	(1, 6, null, 'camp7458', 441),
	(1, 1, null, 'tshort7142', 112),
	(1, 1, null, 'ccamp652', 234),
	(1, 2, 'awdawd', 'dcim1444', 125),
	(1, 2, 'adwawd', 'dcim1445', 142),
	(1, 2, 'awdadaw', 'dcim1449', 175),
	(1, 6, 'ahft', 'dcim8452', 745);

insert into photo_albums (name, event_id) values
	('Щелкунчик 31.12.19 19-00', 1),
	('Щелкунчик 31.12.19 12-00', 2),
	('№13D', 6),
	('Разное', null);

insert into photos (album_id, media_id) values
	(1, 5),
	(1, 6),
	(2, 7),
	(2, 8),
	(2, 9),
	(3, 4),
	(3, 10),
	(4, 1),
	(4, 2),
	(4, 3);
